package com.delvin;

/*
* Реализовать   программу   для   ЭЦП   файла.   Программа   по   запросу
* пользователя   должна   генерировать   пару   файлов:   с   открытым
* ключом   —   для   проверки   подписи,   с   закрытым   ключом   —   для
* создания подписи. В режиме подписи файла на вход поступают: имя
* подписываемого   файла   и   файл   с   закрытым   ключом;   выход   —
* подписанный  файл  (файл  дополненный  блоком,  содержащим
* подпись).  В  режиме  проверки  подписи  на  вход  поступают:
* подписанный файл и файл с открытым ключом; выход — исходный
* файл и сообщение о наличии или отсутствии искажения.
*/

public class App 
{
    public static void main( String[] args )
    {
        System.out.println( "Hello World!" );
    }
}
